In [120]:
# 모듈 로딩 -------------------------------------------------------------------
import pandas as pd, os
import numpy as np

# 파일 관련 변수들
DIR='../Data/'
FILE=DIR+'titanic.csv'

FILE

'../Data/titanic.csv'

In [121]:
titanicDF=pd.read_csv(FILE)
titanicDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [122]:
titanicDF.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [123]:
titanicDF.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [124]:
titanicDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [125]:
subDF=titanicDF.loc[:5 , ['Age','Fare']]      # iloc 아니라서 5 포함임
subDF['Value']=10
subDF.head()

    Age     Fare  Value
0  22.0   7.2500     10
1  38.0  71.2833     10
2  26.0   7.9250     10
3  35.0  53.1000     10
4  35.0   8.0500     10

In [126]:
# 사용자 정의 함수 ----------------------------------------------------------------
def addValue(x):
    print(f'[DEBUG]----------\n {x}')
    return x+x

def addTwoValue(x, y, z):
    print(f'[DEBUG]----------\n {x}, {y}, {z}')
    return x+y

# Series 객체 단위 ----------------------------------------------------------------------
def missingValueCheck(sr):
    print(f'[DEBUG]----------\n {sr}')
    return sr.isnull()

def missingValueSum(sr):
    print(f'[DEBUG]----------\n {sr}')
    return sr.isnull().sum()

In [127]:
subDF.apply(missingValueSum, axis=1)

[DEBUG]----------
 Age      22.00
Fare      7.25
Value    10.00
Name: 0, dtype: float64
[DEBUG]----------
 Age      38.0000
Fare     71.2833
Value    10.0000
Name: 1, dtype: float64
[DEBUG]----------
 Age      26.000
Fare      7.925
Value    10.000
Name: 2, dtype: float64
[DEBUG]----------
 Age      35.0
Fare     53.1
Value    10.0
Name: 3, dtype: float64
[DEBUG]----------
 Age      35.00
Fare      8.05
Value    10.00
Name: 4, dtype: float64
[DEBUG]----------
 Age          NaN
Fare      8.4583
Value    10.0000
Name: 5, dtype: float64

0    0
1    0
2    0
3    0
4    0
5    1
dtype: int64

In [128]:
import numpy as np

subDF.applymap(np.sum)        # applymap 원소 단위로 하나하나 들어가서 결과 나옴?? 자기 밖에 없어서 그대로 나옴?

    Age     Fare  Value
0  22.0   7.2500     10
1  38.0  71.2833     10
2  26.0   7.9250     10
3  35.0  53.1000     10
4  35.0   8.0500     10
5   NaN   8.4583     10

In [129]:
subDF.applymap(addValue)

[DEBUG]----------
 22.0
[DEBUG]----------
 38.0
[DEBUG]----------
 26.0
[DEBUG]----------
 35.0
[DEBUG]----------
 35.0
[DEBUG]----------
 nan
[DEBUG]----------
 7.25
[DEBUG]----------
 71.2833
[DEBUG]----------
 7.925
[DEBUG]----------
 53.1
[DEBUG]----------
 8.05
[DEBUG]----------
 8.4583
[DEBUG]----------
 10
[DEBUG]----------
 10
[DEBUG]----------
 10
[DEBUG]----------
 10
[DEBUG]----------
 10
[DEBUG]----------
 10

    Age      Fare  Value
0  44.0   14.5000     20
1  76.0  142.5666     20
2  52.0   15.8500     20
3  70.0  106.2000     20
4  70.0   16.1000     20
5   NaN   16.9166     20

In [130]:
subDF.apply(np.sum)       # apply 시리즈 단위로 들어감? 컬럼이 들어가서 나옴??

Age      156.0000
Fare     156.0666
Value     60.0000
dtype: float64

In [131]:
subDF.apply(addValue)

[DEBUG]----------
 0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
Name: Age, dtype: float64
[DEBUG]----------
 0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
5     8.4583
Name: Fare, dtype: float64
[DEBUG]----------
 0    10
1    10
2    10
3    10
4    10
5    10
Name: Value, dtype: int64

    Age      Fare  Value
0  44.0   14.5000     20
1  76.0  142.5666     20
2  52.0   15.8500     20
3  70.0  106.2000     20
4  70.0   16.1000     20
5   NaN   16.9166     20

In [132]:
subDF.pipe(addValue)       # pipe는 덩어리로 들어가서 나옴

[DEBUG]----------
     Age     Fare  Value
0  22.0   7.2500     10
1  38.0  71.2833     10
2  26.0   7.9250     10
3  35.0  53.1000     10
4  35.0   8.0500     10
5   NaN   8.4583     10

    Age      Fare  Value
0  44.0   14.5000     20
1  76.0  142.5666     20
2  52.0   15.8500     20
3  70.0  106.2000     20
4  70.0   16.1000     20
5   NaN   16.9166     20

In [133]:
subDF.pipe(np.sum)

Age      156.0000
Fare     156.0666
Value     60.0000
dtype: float64

## ------------------------------------------------------------------------

In [134]:
# 요약 정보 확인
titanicDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [135]:
# 상위 5행 보기
titanicDF.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [136]:
# 'Age' 컬럼의 고유값 확인
titanicDF['Age'].unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [137]:
# 'Age' 컬럼(series)의 평균
# titanicDF['Age'].mode()
round(titanicDF['Age'].mean())

30

In [138]:
# NaN => 평균이며 최빈값인 30으로 채우기
titanicDF['Age'].fillna(30, inplace=True)
titanicDF

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,30.0,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [139]:
# 탑승객 수 total에 저장
total=len(titanicDF.index)

# 생존자 수 live에 저장
live=len(titanicDF[titanicDF['Survived']==1].index)

In [140]:
# 생존율 구하기
sur=live/total
surPct=sur*100
print(f'타이타닉 생존율은 {round(surPct)}% 입니다.')

타이타닉 생존율은 38% 입니다.

In [141]:
# 생존자 남녀 수 구하기
liveDF=titanicDF[titanicDF['Survived']==1]
liveMale=len(liveDF[liveDF['Sex']=='male'].index)
liveFemale=len(liveDF[liveDF['Sex']=='female'].index)

In [142]:
print(f'생존자 중 남녀 비율은\n남성 ==> {round((liveMale/live)*100)}%, 여성 ==> {round((liveFemale/live)*100)}% 입니다.')

생존자 중 남녀 비율은
남성 ==> 32%, 여성 ==> 68% 입니다.

In [143]:
# 'Age' 컬럼 기술통계 정보
titanicDF['Age'].describe()

count    891.000000
mean      29.758889
std       13.002570
min        0.420000
25%       22.000000
50%       30.000000
75%       35.000000
max       80.000000
Name: Age, dtype: float64

In [144]:
# 'Agd' 컬럼 나이로 구간 나누기
age=liveDF['Age']
age0_20=len(liveDF[age<=20].index)
age20_30=len(liveDF[(age>20) & (age<=30)].index)
age30_40=len(liveDF[(age>30) & (age<=40)].index)
age40_80=len(liveDF[age>40].index)

In [145]:
# 생존자 중 나이 구간별 생존율 구하기
print('나이 구간별 생존율 비교')
print(f'생존자 중 20세 이하 생존율은 {round((age0_20/live)*100)}%',
      f'생존자 중 20세 초과 30세 이하 생존율은 {round((age20_30/live)*100)}%',
      f'생존자 중 30세 초과 40세 이하 생존율은 {round((age30_40/live)*100)}%',
      f'생존자 중 40세 초과 생존율은 {round((age40_80/live)*100)}%', sep='\n')

나이 구간별 생존율 비교
생존자 중 20세 이하 생존율은 24%
생존자 중 20세 초과 30세 이하 생존율은 40%
생존자 중 30세 초과 40세 이하 생존율은 20%
생존자 중 40세 초과 생존율은 16%

In [146]:
# 'Pclass' 컬럼의 고유값 확인
titanicDF.Pclass.unique()

array([3, 1, 2], dtype=int64)

In [147]:
# 'Pclass' 컬럼 등급별 탑승객 리스트에 담기
oneTotal=[]
twoTotal=[]
threeTotal=[]
Pclass=titanicDF.Pclass

for i in titanicDF.Pclass.index:
    if Pclass[i]==1 :
        oneTotal.append(i)
    elif Pclass[i]==2:
        twoTotal.append(i)
    else:
        threeTotal.append(i)

# 'Pclass' 컬럼 등급별 생존자 리스트에 담기
oneLive=[]
twoLive=[]
threeLive=[]
        
for j in liveDF.index:
    if j in titanicDF.Pclass.index:
        if Pclass[j]==1 :
            oneLive.append(j)
        elif Pclass[j]==2:
            twoLive.append(j)
        else:
            threeLive.append(j)

In [148]:
# 'Pclass' 등급별 탑승객과 생존자 수 구하기
oneT=len(oneTotal)
twoT=len(twoTotal)
threeT=len(threeTotal)

oneL=len(oneLive)
twoL=len(twoLive)
threeL=len(threeLive)

In [149]:
# 등급별 생존율 구하기
print('등급별 생존율 비교')
print(f'1등급 탑승객 중 생존율은 {round((oneL/oneT)*100)}%',
      f'2등급 탑승객 중 생존율은 {round((twoL/twoT)*100)}%',
      f'3등급 탑승객 중 생존율은 {round((threeL/threeT)*100)}%',sep='\n')

등급별 생존율 비교
1등급 탑승객 중 생존율은 63%
2등급 탑승객 중 생존율은 47%
3등급 탑승객 중 생존율은 24%